Revit 2026 API

# ComponentRepeaterIteratorGetCurrent Method

---

Returns the current repeater slot.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ComponentRepeaterSlot GetCurrent()
```
```vb
Public Function GetCurrent As ComponentRepeaterSlot
```
```cpp
public:
ComponentRepeaterSlot^ GetCurrent()
```
```fsharp
member GetCurrent : unit -> ComponentRepeaterSlot
```

#### Return Value

ComponentRepeaterSlot The current slot.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

#### Reference

ComponentRepeaterIterator Class

Autodesk.Revit.DB Namespace